tap "alexsjones/llmfit", "https://github.com/AlexsJones/homebrew-llmfit"
tap "andyyyy64/whichllm", trusted: { formulae: ["whichllm"] }
tap "aovestdipaperino/tap", trusted: true
tap "blak0p/tap", trusted: true
tap "gentleman-programming/tap", trusted: true
tap "thdxg/tap", trusted: { casks: ["macterm"] }
tap "ublue-os/tap", trusted: true
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AI agent toolkit
brew "pi-coding-agent"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Incremental parsing library
brew "tree-sitter"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# AI-powered local git operations via MCP. Zero cloud tokens for git.
brew "blak0p/tap/git-courer"
# Persistent memory for AI coding agents. Agent-agnostic, single binary, zero dependencies.
brew "gentleman-programming/tap/engram", link: false
# Gentle-AI — Ecosystem, Frameworks, Workflows for AI coding agents.
brew "gentleman-programming/tap/gentle-ai", trusted: true
# Interactive TUI installer for Gentleman.Dots development environment
brew "gentleman-programming/tap/gentleman-dots", trusted: true
# Gentleman Guardian Angel - Provider-agnostic code review using AI (Claude, Gemini, Codex, OpenCode, Ollama)
brew "gentleman-programming/tap/gga"
# Agent orchestration platform
cask "ublue-os/tap/antigravity-linux"
cask "font-fira-code-nerd-font"
# Discover, download, and run local LLMs
cask "ublue-os/tap/lm-studio-linux"
# Open-source code editor
cask "ublue-os/tap/visual-studio-code-linux", trusted: true
flatpak "app.xemu.xemu"
flatpak "app.zen_browser.zen"
flatpak "com.discordapp.Discord"
flatpak "com.github.Matoking.protontricks"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.google.Chrome"
flatpak "com.heroicgameslauncher.hgl"
flatpak "com.jetbrains.IntelliJ-IDEA-Ultimate"
flatpak "com.obsproject.Studio"
flatpak "com.parsecgaming.parsec"
flatpak "com.ranfdev.DistroShelf"
flatpak "com.rtosta.zapzap"
flatpak "com.steamgriddb.steam-rom-manager"
flatpak "com.supermodel3.Supermodel"
flatpak "com.vysp3r.ProtonPlus"
flatpak "dev.vencord.Vesktop"
flatpak "io.dbeaver.DBeaverCommunity"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.shiiion.primehack"
flatpak "io.github.streetpea.Chiaki4deck"
flatpak "io.missioncenter.MissionCenter"
flatpak "it.mijorus.gearlever"
flatpak "md.obsidian.Obsidian"
flatpak "net.kuribo64.melonDS"
flatpak "org.DolphinEmu.dolphin-emu"
flatpak "org.azahar_emu.Azahar"
flatpak "org.fedoraproject.MediaWriter"
flatpak "org.kde.filelight"
flatpak "org.kde.gwenview"
flatpak "org.kde.haruna"
flatpak "org.kde.kcalc"
flatpak "org.kde.kdenlive"
flatpak "org.kde.okular"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.libretro.RetroArch"
flatpak "org.mozilla.firefox"
flatpak "org.pegasus_frontend.Pegasus"
flatpak "org.ppsspp.PPSSPP"
flatpak "org.prismlauncher.PrismLauncher"
flatpak "org.qbittorrent.qBittorrent"
flatpak "org.ryujinx.Ryujinx"
flatpak "org.scummvm.ScummVM"
flatpak "org.telegram.desktop"
flatpak "org.vinegarhq.Sober"
flatpak "org.virt_manager.virt-manager"
flatpak "org.virt_manager.virt-viewer"
flatpak "sh.ppy.osu"
flatpak "xyz.xclicker.xclicker"
npm "@bitbonsai/mcpvault"
npm "@colbymchenry/codegraph"
npm "@gitbook/cli"
npm "@google/gemini-cli"
npm "@openai/codex"
npm "antigravity-usage"
npm "neovim"
npm "pnpm"
