tap "ublue-os/tap"
tap "aovestdipaperino/tap"
tap "gentleman-programming/homebrew-tap"

brew "opencode"
brew "oh-my-posh"
brew "lazygit"
brew "btop"
brew "bat"
brew "eza"
brew "fzf"
brew "zoxide"
brew "glow"
brew "ripgrep"
brew "fastfetch"
brew "ollama"
brew "node"
brew "tokensave"
brew "engram"
brew "gentle-ai"
brew "gh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "antigravity-linux"
cask "lm-studio-linux"
