# Paquetes via Pacman (no disponibles en brew)
# ============================================

# WM / Desktop
hyprland
hyprlock
hypridle
hyprpaper
hyprpicker
waybar
grim
slurp
swappy
cliphist
fuzzel
thunar
xsettingsd
qtengine-git
caelestia-shell-git
caelestia-cli-git

# GTK / Themes
gtk3
gtk4
gtk-layer-shell
adw-gtk-theme
papirus-icon-theme

# Audio
pavucontrol
pamixer
playerctl
brightnessctl
wireplumber
pipewire
pipewire-pulse
pipewire-alsa

# Fonts
ttf-jetbrains-mono-nerd
ttf-meslo-nerd
ttf-cascadia-code-nerd
ttf-fantasque-nerd
ttf-font-awesome
noto-fonts
noto-fonts-emoji
otf-font-awesome

# System
polkit-gnome
dunst
udisks2
pkgfile
archlinux-keyring
reflector

# Dev
base-devel
git
go
rust
nodejs
npm
python
python-pip

# Gaming
steam
steam-devices
umu-launcher
proton-cachyos-slr
protontricks
wine
winetricks
PrismLauncher  # flatpak

# Misc
spicetify-cli
firefox
zen-browser-bin
flathub  # flatpak
